"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например:
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user() которая с помощью функции input()
  просит пользователя ввести вопрос, а затем, если вопрос есть
  в словаре, программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
    
"""

questions_and_answers = {
    '2 + 2': '4',
    '3 * 3': '9',
    '4 - 5': '-1',
    '9 * 8': '72',
}


def ask_user(answers_dict):
    """
    Замените pass на ваш код
    """
    user_question = input('Введите Ваш вопрос:\nПользователь: ')
    while user_question not in answers_dict.keys():
        print('Программа: Я не понимаю вопроса.')
        user_question = input('Введите Ваш вопрос:\nПользователь: ')
    print(f'Программа: {answers_dict[user_question]}')


if __name__ == "__main__":
    ask_user(questions_and_answers)
